<template>
  <div class="block">
    <el-timeline>
      <el-timeline-item v-for="(item,index) of timeline" :key="index" :timestamp="item.timestamp" placement="top">
        <el-card>
          <h4>{{ item.title }}</h4>
          <p>{{ item.content }}</p>
        </el-card>
      </el-timeline-item>
    </el-timeline>
  </div>
</template>

<script>
export default {
  data() {
    return {
      timeline: [
        {
          timestamp: '2019年11月13日',
          title: '习近平同巴西总统博索纳罗会谈',
          content: '习近平指出，上个月，博索纳罗总统成功对中国进行国事访问，我们达成的共识正在得到积极落实。在刚刚结束的第二届中国国际进口博览会上，巴西参展方的成交额比上届增长3.6倍，成绩喜人。中巴作为东西半球最大的新兴市场国家，拥有广泛共同利益。我们看好巴西发展前景，对中巴合作充满信心，愿同巴西分享发展经验，共享发展成果，实现共同繁荣。我愿同你一道，把握好、引领好中巴关系发展方向。'
        },
        {
          timestamp: '2019年11月13日',
          title: '金砖机制推动全球治理体系改革和建设',
          content: '金砖国家领导人第十一次会晤11月13-14日在巴西首都巴西利亚举行。会晤主题为“经济增长打造创新未来”，主要议题包括加强科技创新合作、推动数字经济合作、打击有组织犯罪等。'
        },
        {
          timestamp: '2019年11月13日',
          title: '彭丽媛出席金砖国家领导人配偶活动',
          content: '新华社巴西利亚11月13日电（记者蒋国鹏）当地时间11月13日中午，应巴西总统夫人米歇尔邀请，国家主席习近平夫人彭丽媛出席金砖国家领导人配偶活动彭丽媛和南非总统夫人莫采佩在米歇尔陪同下参观了巴西总统官邸黎明宫。彭丽媛同米歇尔和莫采佩亲切寒暄、合影留念，共同观看巴西青少年管乐团表演，并同演员们亲切交流。彭丽媛表示，今天的活动使我充分感受到巴西文化艺术的独特魅力。中巴虽相隔万里，但友好深入人心。今年恰逢中巴建交45周年，双方举行了一系列文化庆祝活动，受到两国人民欢迎和喜爱。希望双方不断扩大文化交流互鉴，进一步拉近两国人民心灵的距离，让中巴友谊之树万古长青。'
        },
        {
          timestamp: '2019年11月13日',
          title: '金砖国家人文交流论坛暨联拍联播纪录片全球首映式在巴西举行',
          content: '新华社巴西利亚11月13日电（记者周星竹）在金砖国家领导人第十一次会晤期间，金砖国家人文交流论坛暨首部金砖国家联拍纪录片《孩童和荣耀》全球首映式在巴西首都巴西利亚成功举办。本次活动是金砖国家领导人会晤的重要配套活动，由中国国务院新闻办、中国外文局联合巴方共同主办。'
        }
      ]
    }
  }
}
</script>
